csnol/1CHIP-Project/boards.txt
DISCOVERY_F429ZI.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DISCOVERY_F429ZI.build.series=STM32F4
DISCOVERY_F429ZI.build.variant=DISCOVERY_F429ZI

DISCOVERY_F429ZI.build.extra_flags=-DSTM32F429ZI -DSTM32F429xx -DHSE_VALUE=8000000
# TODO f_cpu, and check SystemClock_Config() 
# DISCOVERY_F429ZI.build.f_cpu=168000000L

DISCOVERY_F429ZI.upload.protocol=STLink
DISCOVERY_F429ZI.upload.tool=stlink_upload

DISCOVERY_F429ZI.menu.usb.SerialUSB=Serial [Virtual COM port]
DISCOVERY_F429ZI.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
DISCOVERY_F429ZI.menu.usb.SerialMSC=Mass storage [testing, see documentation]
DISCOVERY_F429ZI.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
DISCOVERY_F429ZI.menu.usb.Disabled=Disabled, no USB

DISCOVERY_F429ZI.menu.serial.SerialUSB=SerialUSB
DISCOVERY_F429ZI.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB
DISCOVERY_F429ZI.menu.serial.SerialUART1=SerialUART1 [PA9/PA10]
DISCOVERY_F429ZI.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1

################################################################################
# Discovery F746NG board

DISCOVERY_F746NG.name=Discovery F746NG

DISCOVERY_F746NG.upload.maximum_size=1048576
DISCOVERY_F746NG.upload.maximum_data_size=327680

DISCOVERY_F746NG.build.core=arduino
DISCOVERY_F746NG.build.board=DISCO_F746NG

DISCOVERY_F746NG.build.mcu=cortex-m7 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
DISCOVERY_F746NG.build.series=STM32F7
DISCOVERY_F746NG.build.variant=DISCOVERY_F746NG
DISCOVERY_F746NG.build.extra_flags=-DSTM32F746NG -DDATA_IN_ExtSDRAM
DISCOVERY_F746NG.build.f_cpu=218000000L

DISCOVERY_F746NG.upload.protocol=STLink
DISCOVERY_F746NG.upload.tool=stlink_upload

DISCOVERY_F746NG.menu.upload_method.STLinkMethod=STLink
DISCOVERY_F746NG.menu.upload_method.STLinkMethod.upload.protocol=STLink
DISCOVERY_F746NG.menu.upload_method.STLinkMethod.upload.tool=stlink_upload

DISCOVERY_F746NG.menu.upload_method.MassStorageMethod=Mass Storage
DISCOVERY_F746NG.menu.upload_method.MassStorageMethod.upload.protocol=
DISCOVERY_F746NG.menu.upload_method.MassStorageMethod.upload.tool=nucleoFlasher
DISCOVERY_F746NG.menu.upload_method.MassStorageMethod.massstorage_drive=DIS_F746NG

DISCOVERY_F746NG.menu.usb.SerialUSB=Serial [Virtual COM port, PA11/PA12 pins]
DISCOVERY_F746NG.menu.usb.SerialUSB.build.extra_flags_usb=-DMENU_USB_SERIAL
DISCOVERY_F746NG.menu.usb.SerialMSC=Mass storage [testing, see documentation]
DISCOVERY_F746NG.menu.usb.SerialMSC.build.extra_flags_usb=-DMENU_USB_MASS_STORAGE
DISCOVERY_F746NG.menu.usb.Disabled=Disabled, no USB

DISCOVERY_F746NG.menu.serial.SerialUART1=SerialUART1 [Through ST-Link Virtual COM port] [PB7/PA9]
DISCOVERY_F746NG.menu.serial.SerialUART1.build.extra_flags_serial=-DMENU_SERIAL=SerialUART1
DISCOVERY_F746NG.menu.serial.SerialUSB=SerialUSB
DISCOVERY_F746NG.menu.serial.SerialUSB.build.extra_flags_serial=-DMENU_SERIAL=SerialUSB

##########################-1CHIP_F030F4T-#######################################
# 1CHIP_F030F4T board

1CHIP_F030F4T.name= 1CHIP_F030F4T

1CHIP_F030F4T.build.core=arduino
1CHIP_F030F4T.build.board=1CHIP_F030F4T
1CHIP_F030F4T.upload.tool=nucleoFlasher

1CHIP_F030F4T.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

1CHIP_F030F4T.upload.maximum_size=16384
1CHIP_F030F4T.upload.maximum_data_size=4096
1CHIP_F030F4T.build.mcu=cortex-m0
1CHIP_F030F4T.build.series=STM32F0
1CHIP_F030F4T.build.variant=1CHIP_F030F4T
1CHIP_F030F4T.build.board=1CHIP_F030F4T
1CHIP_F030F4T.build.extra_flags=-DSTM32F030F4
###1CHIP_F030F4T.massstorage_drive=NUCLEO
1CHIP_F030F4T.build.f_cpu=48000000L

1CHIP_F030F4T.menu.upload_method.STLinkMethod=STLink
1CHIP_F030F4T.menu.upload_method.STLinkMethod.upload.protocol=STLink
1CHIP_F030F4T.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
###1CHIP_F030F4T.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

1CHIP_F030F4T.menu.upload_method.serialMethod=Serial UART1 [TX/PA2, RX/PA3, BOOT0=1]
1CHIP_F030F4T.menu.upload_method.serialMethod.upload.protocol=maple_serial
1CHIP_F030F4T.menu.upload_method.serialMethod.upload.tool=serial_upload
1CHIP_F030F4T.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

##########################-1CHIP_F030K6T-#######################################
# 1CHIP_F030K6T board

1CHIP_F030K6T.name= 1CHIP_F030K6T

1CHIP_F030K6T.build.core=arduino
1CHIP_F030K6T.build.board=1CHIP_F030K6T
1CHIP_F030K6T.upload.tool=nucleoFlasher

1CHIP_F030K6T.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

1CHIP_F030K6T.upload.maximum_size=32768
1CHIP_F030K6T.upload.maximum_data_size=4096
1CHIP_F030K6T.build.mcu=cortex-m0
1CHIP_F030K6T.build.series=STM32F0
1CHIP_F030K6T.build.variant=1CHIP_F030K6T
1CHIP_F030K6T.build.board=1CHIP_F030K6T
1CHIP_F030K6T.build.extra_flags=-DSTM32F030K6
###1CHIP_F030K6T.massstorage_drive=NUCLEO
1CHIP_F030K6T.build.f_cpu=48000000L

1CHIP_F030K6T.menu.upload_method.STLinkMethod=STLink
1CHIP_F030K6T.menu.upload_method.STLinkMethod.upload.protocol=STLink
1CHIP_F030K6T.menu.upload_method.STLinkMethod.upload.tool=stlink_upload
###1CHIP_F030K6T.menu.upload_method.STLinkMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

1CHIP_F030K6T.menu.upload_method.serialMethod=Serial UART1 [TX/PA2, RX/PA3, BOOT0=1]
1CHIP_F030K6T.menu.upload_method.serialMethod.upload.protocol=maple_serial
1CHIP_F030K6T.menu.upload_method.serialMethod.upload.tool=serial_upload
1CHIP_F030K6T.menu.upload_method.serialMethod.build.extra_flags_serial_auto=-DMENU_SERIAL_AUTO=SerialUART1

